# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'trash'
brew 'wget'

# Development
brew 'php70', args: ['with-debug', 'without-apache']
brew 'mariadb'

#
# Apps
#
cask 'adobe-creative-cloud'
cask 'adobe-illustrator-cc'
cask 'adobe-indesign-cc'
cask 'adobe-photoshop-cc'
cask 'adobe-photoshop-lightroom'
cask 'airfoil'
cask 'alfred'
cask 'atom'
cask 'carbon-copy-cloner'
cask 'cheatsheet'
cask 'divvy'
cask 'dropbox'
cask 'figma'
cask 'firefox'
cask 'google-chrome'
cask 'google-drive'
cask 'harvest'
cask 'iterm2'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'ynab'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
